{"class_name": "Sequential", "config": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 96, 96], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "zero_padding2d_24", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_24", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_24", 0, 0, {}]]]}, {"name": "bn1", "class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_38", "class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_25", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_25", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"name": "max_pooling2d_7", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["zero_padding2d_25", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"name": "bn2", "class_name": "BatchNormalization", "config": {"name": "bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "activation_39", "class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_26", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_26", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_26", 0, 0, {}]]]}, {"name": "bn3", "class_name": "BatchNormalization", "config": {"name": "bn3", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "activation_40", "class_name": "Activation", "config": {"name": "activation_40", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3", 0, 0, {}]]]}, {"name": "zero_padding2d_27", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_27", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_40", 0, 0, {}]]]}, {"name": "max_pooling2d_8", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["zero_padding2d_27", 0, 0, {}]]]}, {"name": "inception_3a_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_3a_3x3_conv1", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "inception_3a_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_3a_5x5_conv1", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "inception_3a_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3a_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_3a_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3a_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_41", "class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_43", "class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_5x5_bn1", 0, 0, {}]]]}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "zero_padding2d_28", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_28", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_41", 0, 0, {}]]]}, {"name": "zero_padding2d_29", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_29", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_43", 0, 0, {}]]]}, {"name": "inception_3a_pool_conv", "class_name": "Conv2D", "config": {"name": "inception_3a_pool_conv", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "inception_3a_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_3a_3x3_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_28", 0, 0, {}]]]}, {"name": "inception_3a_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_3a_5x5_conv2", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_29", 0, 0, {}]]]}, {"name": "inception_3a_pool_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3a_pool_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_pool_conv", 0, 0, {}]]]}, {"name": "inception_3a_1x1_conv", "class_name": "Conv2D", "config": {"name": "inception_3a_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "inception_3a_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3a_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_3a_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3a_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_5x5_conv2", 0, 0, {}]]]}, {"name": "activation_45", "class_name": "Activation", "config": {"name": "activation_45", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_pool_bn", 0, 0, {}]]]}, {"name": "inception_3a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3a_1x1_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3a_1x1_conv", 0, 0, {}]]]}, {"name": "activation_42", "class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_44", "class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_30", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_30", "trainable": true, "padding": [[3, 4], [3, 4]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_45", 0, 0, {}]]]}, {"name": "activation_46", "class_name": "Activation", "config": {"name": "activation_46", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3a_1x1_bn", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_42", 0, 0, {}], ["activation_44", 0, 0, {}], ["zero_padding2d_30", 0, 0, {}], ["activation_46", 0, 0, {}]]]}, {"name": "inception_3b_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_3b_3x3_conv1", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "inception_3b_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_3b_5x5_conv1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "inception_3b_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3b_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_3b_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3b_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_47", "class_name": "Activation", "config": {"name": "activation_47", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_49", "class_name": "Activation", "config": {"name": "activation_49", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_5x5_bn1", 0, 0, {}]]]}, {"name": "average_pooling2d_5", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_5", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "zero_padding2d_31", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_31", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_47", 0, 0, {}]]]}, {"name": "zero_padding2d_32", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_32", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_49", 0, 0, {}]]]}, {"name": "inception_3b_pool_conv", "class_name": "Conv2D", "config": {"name": "inception_3b_pool_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]]}, {"name": "inception_3b_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_3b_3x3_conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_31", 0, 0, {}]]]}, {"name": "inception_3b_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_3b_5x5_conv2", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_32", 0, 0, {}]]]}, {"name": "inception_3b_pool_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3b_pool_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_pool_conv", 0, 0, {}]]]}, {"name": "inception_3b_1x1_conv", "class_name": "Conv2D", "config": {"name": "inception_3b_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "inception_3b_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3b_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_3b_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3b_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_5x5_conv2", 0, 0, {}]]]}, {"name": "activation_51", "class_name": "Activation", "config": {"name": "activation_51", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_pool_bn", 0, 0, {}]]]}, {"name": "inception_3b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "inception_3b_1x1_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3b_1x1_conv", 0, 0, {}]]]}, {"name": "activation_48", "class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_50", "class_name": "Activation", "config": {"name": "activation_50", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_33", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_33", "trainable": true, "padding": [[4, 4], [4, 4]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_51", 0, 0, {}]]]}, {"name": "activation_52", "class_name": "Activation", "config": {"name": "activation_52", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3b_1x1_bn", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_48", 0, 0, {}], ["activation_50", 0, 0, {}], ["zero_padding2d_33", 0, 0, {}], ["activation_52", 0, 0, {}]]]}, {"name": "inception_3c_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_3c_3x3_conv1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "inception_3c_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_3c_5x5_conv1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "inception_3c_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3c_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_3c_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_3c_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_53", "class_name": "Activation", "config": {"name": "activation_53", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_55", "class_name": "Activation", "config": {"name": "activation_55", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_5x5_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_34", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_34", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_53", 0, 0, {}]]]}, {"name": "zero_padding2d_35", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_35", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_55", 0, 0, {}]]]}, {"name": "inception_3c_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_3c_3x3_conv2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_34", 0, 0, {}]]]}, {"name": "inception_3c_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_3c_5x5_conv2", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_35", 0, 0, {}]]]}, {"name": "inception_3c_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3c_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_3c_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_3c_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_3c_5x5_conv2", 0, 0, {}]]]}, {"name": "max_pooling2d_10", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "activation_54", "class_name": "Activation", "config": {"name": "activation_54", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_56", "class_name": "Activation", "config": {"name": "activation_56", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_3c_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_36", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_36", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "concatenate_10", "class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_54", 0, 0, {}], ["activation_56", 0, 0, {}], ["zero_padding2d_36", 0, 0, {}]]]}, {"name": "inception_4a_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_4a_3x3_conv1", "trainable": true, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "inception_4a_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_4a_5x5_conv1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "inception_4a_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4a_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_4a_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4a_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_57", "class_name": "Activation", "config": {"name": "activation_57", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_59", "class_name": "Activation", "config": {"name": "activation_59", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_5x5_bn1", 0, 0, {}]]]}, {"name": "average_pooling2d_6", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_6", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "zero_padding2d_37", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_37", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_57", 0, 0, {}]]]}, {"name": "zero_padding2d_38", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_38", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_59", 0, 0, {}]]]}, {"name": "inception_4a_pool_conv", "class_name": "Conv2D", "config": {"name": "inception_4a_pool_conv", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_6", 0, 0, {}]]]}, {"name": "inception_4a_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_4a_3x3_conv2", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_37", 0, 0, {}]]]}, {"name": "inception_4a_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_4a_5x5_conv2", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_38", 0, 0, {}]]]}, {"name": "inception_4a_pool_bn", "class_name": "BatchNormalization", "config": {"name": "inception_4a_pool_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_pool_conv", 0, 0, {}]]]}, {"name": "inception_4a_1x1_conv", "class_name": "Conv2D", "config": {"name": "inception_4a_1x1_conv", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "inception_4a_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4a_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_4a_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4a_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_5x5_conv2", 0, 0, {}]]]}, {"name": "activation_61", "class_name": "Activation", "config": {"name": "activation_61", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_pool_bn", 0, 0, {}]]]}, {"name": "inception_4a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "inception_4a_1x1_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4a_1x1_conv", 0, 0, {}]]]}, {"name": "activation_58", "class_name": "Activation", "config": {"name": "activation_58", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_3x3_bn2", 0, 0, {}]]]}, {"name": "activation_60", "class_name": "Activation", "config": {"name": "activation_60", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_5x5_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_39", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_39", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_61", 0, 0, {}]]]}, {"name": "activation_62", "class_name": "Activation", "config": {"name": "activation_62", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4a_1x1_bn", 0, 0, {}]]]}, {"name": "concatenate_11", "class_name": "Concatenate", "config": {"name": "concatenate_11", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_58", 0, 0, {}], ["activation_60", 0, 0, {}], ["zero_padding2d_39", 0, 0, {}], ["activation_62", 0, 0, {}]]]}, {"name": "inception_4e_3x3_conv1", "class_name": "Conv2D", "config": {"name": "inception_4e_3x3_conv1", "trainable": true, "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_11", 0, 0, {}]]]}, {"name": "inception_4e_5x5_conv1", "class_name": "Conv2D", "config": {"name": "inception_4e_5x5_conv1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_11", 0, 0, {}]]]}, {"name": "inception_4e_3x3_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4e_3x3_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4e_3x3_conv1", 0, 0, {}]]]}, {"name": "inception_4e_5x5_bn1", "class_name": "BatchNormalization", "config": {"name": "inception_4e_5x5_bn1", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4e_5x5_conv1", 0, 0, {}]]]}, {"name": "activation_63", "class_name": "Activation", "config": {"name": "activation_63", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4e_3x3_bn1", 0, 0, {}]]]}, {"name": "activation_65", "class_name": "Activation", "config": {"name": "activation_65", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["inception_4e_5x5_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_40", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_40", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_63", 0, 0, {}]]]}, {"name": "zero_padding2d_41", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_41", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["activation_65", 0, 0, {}]]]}, {"name": "inception_4e_3x3_conv2", "class_name": "Conv2D", "config": {"name": "inception_4e_3x3_conv2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_40", 0, 0, {}]]]}, {"name": "inception_4e_5x5_conv2", "class_name": "Conv2D", "config": {"name": "inception_4e_5x5_conv2", "trainable": true, "filters": 128, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_41", 0, 0, {}]]]}, {"name": "inception_4e_3x3_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4e_3x3_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["inception_4e_3x3_conv2", 0, 0, {}]]]}, {"name": "inception_4e_5x5_bn2", "class_name": "BatchNormalization", "config": {"name": "inception_4e_5x5_bn2", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null,